In [2]:
import pandas as pd

In [3]:
import pandas as pd
mydataset = {
        'cars': ["BMW", "Volvo", "Ford"],
  'passings': [3, 7, 2]
}

myvar = pd.DataFrame(mydataset)

print(myvar)

    cars  passings
0    BMW         3
1  Volvo         7
2   Ford         2

In [4]:
import pandas as pd

print(pd.__version__)

2.2.3

In [5]:
import pandas as pd

a = [1, 7, 2]

myvar = pd.Series(a)

print(myvar)

0    1
1    7
2    2
dtype: int64

In [6]:
import pandas as pd
a = [1,2,3,4,5]
mvar = pd.Series(a)
print(myvar)

0    1
1    7
2    2
dtype: int64

In [7]:
import pandas as pd

a = [1, 7, 2]

myvar = pd.Series(a, index = ["x", "y", "z"])

print(myvar)

x    1
y    7
z    2
dtype: int64

In [8]:
print(myvar["y"])

7

In [9]:
import pandas as pd
calories = {"day1":420,"day2":380,"day3":450}
myvar = pd.Series(calories)
print(myvar)

day1    420
day2    380
day3    450
dtype: int64

In [10]:
myvar

day1    420
day2    380
day3    450
dtype: int64

In [11]:
import pandas as pd
data = {
    "calories" : [450,380,390],
    "duration" : [50,40,45]
}
myvar = pd.DataFrame(data)
print(myvar)

   calories  duration
0       450        50
1       380        40
2       390        45

In [12]:
data = pd.read_csv("C:\\Users\\Keerti\\Downloads\\StudentsPerformance.csv")

In [13]:
print("Hello\nWorld\nhow\tr\tu")

Hello
World
how	r	u

In [14]:
data

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75
...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,88,99,95
996,male,group C,high school,free/reduced,none,62,55,55
997,female,group C,high school,free/reduced,completed,59,71,65
998,female,group D,some college,standard,completed,68,78,77
999,female,group D,some college,free/reduced,none,77,86,86

# dataframe attributes

In [15]:
data.columns

Index(['gender', 'race/ethnicity', 'parental level of education', 'lunch',
       'test preparation course', 'math score', 'reading score',
       'writing score'],
      dtype='object')

In [16]:
data.dtypes

gender                         object
race/ethnicity                 object
parental level of education    object
lunch                          object
test preparation course        object
math score                      int64
reading score                   int64
writing score                   int64
dtype: object

In [17]:
data.ndim

2

In [18]:
ds = data.gender 
ds

0      female
1      female
2      female
3        male
4        male
        ...
995    female
996      male
997    female
998    female
999    female
Name: gender, Length: 1000, dtype: object

In [19]:
type(ds)

pandas.core.series.Series

In [20]:
ds.ndim

1

In [22]:
data.size

8000

In [23]:
data.shape

(1000, 8)

# loc iloc and indexing

In [35]:
data.iloc[5:10]

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
5,female,group B,associate's degree,standard,none,71,83,78
6,female,group B,some college,standard,completed,88,95,92
7,male,group B,some college,free/reduced,none,40,43,39
8,male,group D,high school,free/reduced,completed,64,64,67
9,female,group B,high school,free/reduced,none,38,60,50

In [43]:
import pandas as pd

# Creating a sample DataFrame
df = pd.DataFrame({'A': [10, 20, 30, 40, 50], 'B': [100, 200, 300, 400, 500]}, index=['a', 'b', 'c', 'd', 'e'])

df

    A    B
a  10  100
b  20  200
c  30  300
d  40  400
e  50  500

In [44]:
# Select rows from 'b' to 'd' (inclusive)
print(df.loc['a':'c'])

    A    B
a  10  100
b  20  200
c  30  300

In [41]:
df.iloc[1:4, 0:1]

    A
b  20
c  30
d  40

In [45]:
df[ df['A']>20 ]

    A    B
c  30  300
d  40  400
e  50  500

In [58]:
data [data['gender']=="male"]

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75
7,male,group B,some college,free/reduced,none,40,43,39
8,male,group D,high school,free/reduced,completed,64,64,67
10,male,group C,associate's degree,standard,none,58,54,52
...,...,...,...,...,...,...,...,...
985,male,group A,high school,standard,none,57,51,54
987,male,group E,some high school,standard,completed,81,75,76
990,male,group E,high school,free/reduced,completed,86,81,75
994,male,group A,high school,standard,none,63,63,62
996,male,group C,high school,free/reduced,none,62,55,55

In [50]:
print(df.query("A>20 and B<500"))

    A    B
c  30  300
d  40  400

In [62]:
data.query("gender=='male'and lunch=='standard'")

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
4,male,group C,some college,standard,none,76,78,75
10,male,group C,associate's degree,standard,none,58,54,52
11,male,group D,associate's degree,standard,none,40,52,43
13,male,group A,some college,standard,completed,78,72,70
16,male,group C,high school,standard,none,88,89,86
...,...,...,...,...,...,...,...,...
981,male,group D,some high school,standard,none,81,78,78
982,male,group B,some high school,standard,completed,79,85,86
985,male,group A,high school,standard,none,57,51,54
987,male,group E,some high school,standard,completed,81,75,76
994,male,group A,high school,standard,none,63,63,62

In [73]:
data[(data["gender"]=="male")&(data["lunch"]=="standard")][["gender","lunch"]]

    gender     lunch
4     male  standard
10    male  standard
11    male  standard
13    male  standard
16    male  standard
..     ...       ...
981   male  standard
982   male  standard
985   male  standard
987   male  standard
994   male  standard

[316 rows x 2 columns]

In [74]:
data[(data["math score"]>50)&(data["race/ethnicity"]=="group A")][["math score","race/ethnicity"]]

     math score race/ethnicity
13           78        group A
25           73        group A
46           55        group A
62           62        group A
77           80        group A
..          ...            ...
972          53        group A
974          54        group A
983          78        group A
985          57        group A
994          63        group A

[67 rows x 2 columns]

## Missing Values in Pandas ##

In [15]:
import pandas as pd
import numpy as np

data = pd.DataFrame({
    'Data1' : [1,2,4,5,np.nan],
    'Data2' : [5,6,7,9,np.nan],
    'Data3' : ['a','b','d','e',np.nan]
    })

data

   Data1  Data2 Data3
0    1.0    5.0     a
1    2.0    6.0     b
2    4.0    7.0     d
3    5.0    9.0     e
4    NaN    NaN   NaN

In [16]:
data.isna().sum()

Data1    1
Data2    1
Data3    1
dtype: int64

In [17]:
data.head() # first 5 rows

   Data1  Data2 Data3
0    1.0    5.0     a
1    2.0    6.0     b
2    4.0    7.0     d
3    5.0    9.0     e
4    NaN    NaN   NaN

In [18]:
data.tail(1) # last 5 rows

   Data1  Data2 Data3
4    NaN    NaN   NaN

In [ ]:
data.Data1

0    1.0
1    2.0
2    4.0
3    5.0
4    NaN
Name: Data1, dtype: float64

In [20]:
data["Data1"]

0    1.0
1    2.0
2    4.0
3    5.0
4    NaN
Name: Data1, dtype: float64

In [21]:
data[["Data1", "Data2"]]

   Data1  Data2
0    1.0    5.0
1    2.0    6.0
2    4.0    7.0
3    5.0    9.0
4    NaN    NaN

In [23]:
data["Data1"].max()

np.float64(5.0)

In [27]:
data[data["Data2"]>2][["Data3"]]

  Data3
0     a
1     b
2     d
3     e

In [36]:
data

   Data1  Data2 Data3
0    1.0    5.0     a
1    2.0    6.0     b
2    4.0    7.0     d
3    5.0    9.0     e
4    NaN    NaN   NaN

In [37]:
data.index

RangeIndex(start=0, stop=5, step=1)

In [ ]:
data.set_index('Data1', inplace=True)

       Data2 Data3
Data1
1.0      5.0     a
2.0      6.0     b
4.0      7.0     d
5.0      9.0     e
NaN      NaN   NaN

   Data1  Data2 Data3
0    1.0    5.0     a
1    2.0    6.0     b
2    4.0    7.0     d
3    5.0    9.0     e
4    NaN    NaN   NaN